---
kind: property
id: P:Autodesk.Revit.DB.View.AnalysisDisplayStyleId
zh: 视图
source: html/7becc6f0-0510-745b-b4ba-24bbf875919d.htm
---
# Autodesk.Revit.DB.View.AnalysisDisplayStyleId Property

**中文**: 视图

Element id of Analysis Display Style associated with the view.

## Syntax (C#)
```csharp
public ElementId AnalysisDisplayStyleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: Cannot set the AnalysisDisplayStyleId for the specified view.